# RoomOccupancyUnitParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RoomOccupancyUnitParam Property
ParameterTypeId Class See Also
---
"Occupancy Unit"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RoomOccupancyUnitParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomOccupancyUnitParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RoomOccupancyUnitParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace